s = """广告单投递服务合同
甲方（委托方）：
乙方（承接方）：
 
根据《中华人民共和国合同法》等相关法律、法规规定，甲乙双方本着平等自愿和诚实信用原则，经友好协商，就甲方委托乙方承包        （以下简称“插单广告”或“广告”）事宜达成一致意见，特订立本合同，以资共同信守。
第1条 广告投递的时间、内容、数量及对象等
1.1 广告投递的时间：        。
1.2 广告的规格及内容：        。
1.3 广告投递的数量：共    份（一户投一份，每户投递超过一份的，不计入有效投递数量，且超过一份的部分的广告单张的成本由乙方承担，在计算投递率时，每户超过一份的部分的数量视为未投递至指定业主处的广告数量）。
1.4 广告投递的对象：        。
第2条 合同总价及结算总价
2.1 合同总价
本合同按广告投递的数量及相关要求，采用总价包干的承包方式确定的合同总价为人民币（大写）        （￥    元），此价已包括人工、沟通协调及关系处理费（包括但不限于与社区管理人、业主等的关系协调及所有投诉、争议等的处理费用）、人员保险（包括但不限于广告派单人员等的意外伤害险）、合同风险（包括但不限于人工价格上涨，意外情况等）、管理、利润、增值税专用发票（增值税税率为    %）等乙方履行本合同责任和义务所需的全部费用，除甲方书面确定调整广告投递的数量或乙方投递的广告数量不足或任一方存在违约情况外，合同总价不因其它任何原因做调整。
2.2 合同结算总价
合同结算总价的计算公式为：合同总价±甲方书面确认调整广告投递数量或乙方投递的广告数量不足引起增、减的费用±合同约定的违约金、赔偿款。
（1）结算时，需增、减费用的广告投递的单价按¥    元/份计价。
2.3 广告单的设计、制作由甲方自行负责。
第3条 付款方式
3.1 本合同生效，全部的广告投递完毕，经甲方书面验收合格，合同结算总价经甲乙双方书面确认，乙方按合同约定请款后，甲方向乙方支付至合同结算总价的100%。
3.2 请款前，乙方应按照本合同约定及甲方规定，提供符合当次付款条件的等额、合法有效的本项目所在地的税务机关认可的增值税专用发票和相关证明资料（如请款申请、合同复印件、验收合格证明文件等）。甲方在收到乙方相应增值税专用发票和合格请款资料之日起个工作日内完成审核和付款（以转账或支票方式支付款项）。除事先经甲方书面同意外，甲方不接受乙方委托第三方收款的支付方式。乙方未履行前述约定义务或存在违约情形的，甲方有权延迟付款。
3.3 因甲方原因遗失或损坏发票，乙方应提供发票记账联复印件及乙方所在地主管税务机关出具的《丢失增值税发票已报税证明单》等甲方完成税务处理所需的相关资料，否则甲方有权暂停支付任何款项。
3.4 付款时，甲方有权在当次付款中相应扣除应由乙方承担或支付的费用（包括违约金、罚款等）。
3.5 乙方委托甲方将本合同项下款项支付至乙方下述银行账户：
收款人名称：        
开户行名称：        
银行账号：        
若因上述账户错误造成的损失应由乙方自行承担（如逾期付款等）。
第4条 广告投递的验收标准、验收及结算
4.1 本合同广告投递的验收标准为达到100%的投递率（投递率以广告投递对象收到广告的数量与投递对象总数的比值确定）。
4.2 若甲方抽查本合同的广告投递率，乙方同意以甲方抽查的广告投递率（即甲方抽查的广告投递至指定业主处的数量与抽查总数的比值）视为本合同的广告投递率。
4.3 甲方可以要求乙方派人参与本合同广告投递的抽查工作，若乙方未派人参与，视为对甲方抽查结果的认可。
4.4 合同正常履行完毕的结算：
全部数量的广告投递完毕，经甲方书面验收合格，乙方按甲方规定提交结算资料（包括但不限于验收合格证明、投递数量双方确认单、计价表等，以下同），并派专人配合甲方完成计量及计价审核，最后双方书面确定结算总价。
第5条 双方责任
5.1 甲方责任：
5.1.1 甲方委派        （电话        ）为甲方执行联系人，向乙方提供投递的广告单张，对本合同广告投递过程进行监控，组织对乙方投递的广告进行抽检及验收等。与本合同有关的任何甲方的确认或意见等（包括但不限于涉及数量、经济的确认），必须加盖甲方公章方能生效。
5.1.2 甲方应确保广告内容真实、合法。
5.2 乙方责任：
5.2.1 乙方委派        （电话        ）为本合同执行代表，此代表在各种文件上签名的意见（如无异议意见即为对文件的全部确认）对乙方产生合同及法律效力，此代表或乙方员工接收文件后即为文件送达到乙方。
5.2.2 乙方应及时向甲方汇报本合同履行过程中出现的任何问题，并按甲方要求妥善处理好。否则，因此导致的责任及损失由乙方承担。
5.2.3 乙方负责与广告投递对象所在的社区管理人及投递对象的所有联系、沟通、协调工作，并承担全部费用，确保不出现任何的纠纷或侵权行为。否则，由乙方按甲方要求妥善处理好所出现的问题，并承担所有责任及费用，若在出现问题之日起3个日历天内，乙方仍未能按甲方要求妥善处理好，则甲方有权解除本合同，并由乙方按本合同约定承担违约责任。
5.2.4 在本合同履行过程中，出现非甲方原因导致的人身损害和（或）财产损失 [包括但不限于乙方人员和（或）财产损失，第三人的人身和（或）财产损失，乙方原因导致的甲方人员和（或）财产损失等]，概由乙方承担全部责任及损失（若非乙方导致的，但因实际情况需要先垫付费用的，乙方应先行承担，再向责任人追偿）。
5.2.5 及时履行合同约定应由乙方承担的其他义务和职责。
第6条 违约责任
6.1 甲乙双方均应全面履行合同，否则应承担违约赔偿责任。本合同约定的违约金均为惩罚性违约金，不冲抵损失赔偿金额。
6.2 合同履行过程中，双方都应友好协商解决争议。若出现乙方人员（包括但不限于管理人员、乙方聘请的人员等与乙方相关的人员）打架或闹事（包括拉电闸、围堵甲方工作或经营场所、影响政府或企事业单位的正常工作秩序等行为），每发生一次，乙方除妥善处理好所出现的事件及承担全部费用外，还应向甲方支付合同总价30%的违约金。
6.3 由于非甲方的原因造成本合同广告投递延迟，每延迟一天，乙方应按合同总价的百分之一向甲方支付违约金，并赔偿因此给甲方造成的损失。
6.4 若出现乙方虚报投递成功数据、记录等的造假行为时，除按合同约定的投递率计算扣减乙方未完成的广告投递费用外，还应向甲方支付合同总价30%的违约金，并赔偿甲方损失，甲方亦有权解除本合同。
6.5 若乙方向甲方部门和（或）员工输送不当利益（包括但不限于金钱、有价证券、礼物等），乙方应按所输送利益价值总额的5倍向甲方支付违约金。
6.6 出现乙方违约情况时，乙方应按合同约定承担违约责任，若合同未对违约事项约定违约金的，乙方按每次每项¥300元或每天¥300元向甲方支付违约金，并赔偿甲方损失。
6.7 若出现乙方应承担或垫付费用的事项，乙方应妥善处理好有关问题，避免造成甲方垫付有关费用。否则，因乙方原因导致需要甲方垫付，则乙方除全额返还甲方垫付费用外，还需按甲方垫付费用的30%的标准向甲方支付违约金，并赔偿甲方损失。
6.8 因乙方原因导致甲方遭受损失的，由乙方负责赔偿，若甲方的损失额无法准确计算且合同其他条款未明确损失赔偿金额的，则由乙方以合同总价的5%为标准向甲方赔偿。
6.9 若因乙方违反相关法律、法规或税务主管部门规定提供相关税务发票，由此产生的一切法律责任由乙方承担，乙方应按违规发票（如假发票或其他不符合税法或本项目所在地主管税务机关要求的发票等）总额20%向甲方支付违约金，造成甲方损失的（包括但不限于无法抵扣而需多交税款、滞纳金、罚款、处理相关事项产生的费用等），均由乙方赔偿。
6.10 因乙方原因（包括但不限于增值税专用发票超过发票开具日20个日历天仍未提交至甲方或乙方提供虚假发票等）导致甲方不能完成增值税专用发票的认证抵扣，或甲方将发票认证后，该发票又被开票方作废，乙方应向甲方支付发票总额20%的违约金，并赔偿甲方的全部损失（包括但不限于无法抵扣而需多交税款、滞纳金、罚款、处理相关事项产生的费用等）
6.11 若甲方逾期付款，则每逾期一天，应按逾期付款金额的同期银行贷款基准利率向乙方支付利息。
第7条 合同解除
7.1 有下列情形之一，甲方可解除合同：
7.1.1 由于乙方的原因，造成本合同广告投递延迟超过5个日历天，或导致本合同广告投递的目的不能实现，或本合同广告投递率低于90%；
7.1.2 乙方向甲方部门和（或）员工行贿；
7.1.3 乙方人员（包括但不限于为本合同投递广告的人员等）出现严重安全事故（包括重伤或死亡）；
7.1.4 本合同其它条款约定甲方可解除合同的情形。
7.2 任何一方依法定或合同约定行使本合同解除权，均应向对方发出解约通知，自解约通知到达对方之日，本合同即解除，合同解除后，双方应按合同约定办理完相关手续，履行完合同解除后的义务。
7.3 出现合同约定或法定甲方可以解除合同的情形时，如果甲方选择继续履行合同的，乙方应向甲方支付合同总价15%的违约金、赔偿甲方损失，同时按甲方要求妥善处理好所出现的违约事项并承担全部费用。
7.4 若乙方单方解除本合同，或不履行本合同，或中途停止履行合同，或甲方依法、依合同约定解除本合同的，乙方应向甲方支付合同总价30%的违约金、赔偿甲方损失。
7.5 合同解除后的结算：
本合同解除或乙方不履行本合同或中途停止履行合同，合同结算款=甲方确认已合格投递的广告数量×相应合同单价±违约金、赔偿款、扣款。
7.6 合同解除并不免除违约方的违约责任。本合同解除后，合同中的结算条款、违约责任条款、双方配合结算计量计价的条款依然有效（包括但不限于合同中已明示了合同解除后双方或任一方应履行责任和义务的条款，或享有权利的条款）。
第8条 争议解决
8.1 因本合同引起的或与本合同有关的任何争议，由合同各方协商解决，也可由有关部门调解。协商或调解不成的，按下列第    种方式解决：
（1）提交位于        （地点）的        仲裁委员会仲裁。仲裁裁决是终局的，对各方均有约束力；
（2）依法向        所在地有管辖权的人民法院起诉。
8.2 双方约定，在合同当事人之间或与第三人进行诉讼或仲裁的过程中，除法律规定或国家司法机关依职权要求双方中止履行有争议的事项以外，本合同约定的其他事项应当继续履行。
第9条 其他
9.1 除非合同另有明确约定，未经甲方事先书面同意，乙方不得部分或全部转让本合同的权利或义务，否则，由乙方负责按甲方要求改正，并承担由此导致的责任及损失。
9.2 保密责任：甲乙双方对本合同的内容、因履行本合同或在本合同履行期间获得的对方的商业秘密信息承担保密义务，不得擅自向任何第三方披露、泄露，且本保密义务在本合同期满、解除（终止）后仍然有效。
9.3 文件送达：本合同载明的双方的联系地址或双方营业执照中的地址是双方有效法律文件、通知的收发地址，一旦发送至该地址签收，视为完成送达。任何一方如发生地址发生变更，应在变更前通知对方。否则自行承担文件不能送达的后果。
9.4 本合同履行过程中双方签章确认的协议或其他文件均为本合同的组成部分，若合同组成文件之间发生矛盾的，以下排列顺序为合同组成文件之间的优先解释顺序：
（1）合同履行过程中双方签章确认的协议或其他文件；
（2）本合同；
（3）标准、规范及有关技术文件；
（4）其他合同文件。
前述文件应认为是互为补充和解释的，但如有互相矛盾之处，以前述文件所列顺序作为其优先解释的顺序。前述各项文件包括双方就该合同组成文件所作出的补充和修改，属于同一项文件的，应以最新签署的为准。
9.5 本合同一式伍份，甲方持叁份，乙方持贰份，均具同等法律效力，自甲乙双方法定代表人（或授权代表）签字或盖章（公章或合同专用章）之日起生效。
 
签署时间：    年    月    日
 
甲方（盖章）：
法定代表人或授权代表（签字）：
 
乙方（盖章）：
法定代表人或授权代表（签字）：
"""

import json

json.dump(s, open('a.txt', 'w'))